# 3. По введенным пользователем координатам двух точек вывести уравнение
# прямой вида y = kx+b, проходящей через эти точки.

try:
    x1, y1 = input('Координаты x1,y1: ').split(',')
    x2, y2 = input('Координаты x2,y2: ').split(',')
    x1, y1 = (int(x1), int(y1))
    x2, y2 = (int(x2), int(y2))
except:
    print('Неверный ввод')
else:
    if x1 - x2 == 0:
        print('решение не возможно x1=x2')
    else:
        k = (y1 - y2) / (x1 - x2)
        b = y2 - k * x2
        print(f"y = {k}*x + {b}")
